In [1]:
# Pandas
import pandas as pd

# SQL Alchemy
from sqlalchemy import create_engine

from config import access

In [3]:
# Create the connection to the DB
engine = create_engine(f'postgresql://postgres:{access}@localhost:5432/employees_db')
connection = engine.connect()

In [5]:
data = pd.read_sql("SELECT * FROM SALARIES", connection)

In [6]:
data.head()

  emp_no  salary
0  10001   60117
1  10002   65828
2  10003   40006
3  10004   40054
4  10005   78228